import React from 'react';

const LegalTermsPage = () => {
  return (
    <div className="text-gray-800 my-12 mx-12 flex flex-col gap-4 text-sm font-normal">
        <h1 className="font-bold text-2xl">Угода користувача</h1>
    <p>
        Я (надалі – «Я» та/або «Користувач») погоджуюсь з умовами цієї Угоди користувача і, 
        використовуючи сайт: buyeranastasiia.com.ua (надалі – «Сайт») та/або мобільний додаток BUYERANASTASIIA
        (надалі – «Мобільний додаток») та/або інші сервіси (надалі разом іменуються як «Он-лайн 
        платформа buyeranastsiia» та/або «Он-лайн платформа»), при замовленні, листуванні, 
        телефонній розмові, залишенні відгуків тощо, надаю згоду на обробку і захист 
        своїх персональних даних, як Користувача, в обсязі, порядку, відповідно до 
        мети обробки згідно з Положенням про обробку персональних даних, 
        розміщеному тут: (надалі – «Положення» та/або «Положення про обробку 
        і захист персональних даних»).
    </p>
    <h2 className="font-bold text-xl">Персональні дані</h2>
    <p>У доповнення до Положення, на виконання вимог Закону України &quot;Про захист персональних даних&quot;
        шляхом заповнення на Онлайн-платформі заявки для розгляду можливості придбання товару в оплату частинами 
        та натискання кнопки «Замовлення підтверджую» даю згоду на обробку вказаних у заявці моїх 
        персональних даних наступними особами: АТ «ПУМБ» (код ЄДРПОУ - 14282829), АТ «ОТП БAНК» (код ЄДРПОУ– 21685166), 
        АТ &quot;УКРСИББАНК&quot; (код ЄДРПОУ– 09807750), ТОВ &quot;ФК&quot;ЦФР&quot; (код ЄДРПОУ– 35725063), АТ &quot;АЛЬФА-БАНК&quot; (код ЄДРПОУ– 23494714), 
        АТ КБ «ПРИВАТБАНК» (код ЄДРПОУ – 14360570), АТ &quot;УНІВЕРСАЛ БАНК&quot; (код ЄДРПОУ – 21133352), 
        та іншим фінансовим установам, що надають можливість кредитування на Он-лайн платформі buyeranastasiia, 
        з метою забезпечення реалізації цивільно-правових відносин, надання/отримання та здійснення 
        розрахунків за придбані товари/послуги, в тому числі шляхом кредитування. 
        Не заперечую щодо перевірки переліченими у цій Угоді фінансовими установами інформації 
        у будь-яких бюро кредитних історій України з метою з’ясування відомостей, які стосуються 
        виконання мною взятих на себе зобов’язань по договорам (в т.ч. кредитним), у випадку 
        наявності таких, тим самим розуміючи, що об’єм інформації, яка буде перевірятися, 
        може включати в себе інформацію, яка стосується банківської таємниці, 
        і з’ясування якої буде такою, яка буде повною та достатньою для розуміння мого соціального, 
        майнового стану, платоспроможності та несення можливої подальшої майнової відповідальності, 
        у випадку її необхідності.
    </p>
    <p>
        Я також погоджуюсь з тим, що Володілець має право надавати доступ та передавати мої персональні дані 
        третім особам без будь-яких додаткових повідомлень, не змінюючи при цьому мети їх обробки, визначеної в 
        Положенні та цій Угоді. В тому числі, на перевірку зазначеної Мною інформації та не заперечую про передачу 
        для можливого необхідного з&apos;ясування даної інформації третім особам, під якими розумію: фінансові установи, 
        колекторські компанії, оператори мобільного та поштового зв’язку, інші фізичні та/або юридичні особи.
        Надаю згоду запитувати та отримувати в бюро кредитних історій, включених до Єдиного реєстру бюро кредитних 
        історій (надалі – «Бюро»), дані та інформацію у вигляді зведених показників, сформованих на основі інформації, 
        що міститься у моїй кредитній історії та/або на основі інформації доступної з відкритих джерел, від третіх осіб, 
        з використанням доступних Бюро моделей розрахунку, а також на використання зазначеної інформації володільцем 
        та/або третіми особами для визначення та пропонування мені Володільцем в особистому кабінеті на Он-лайн платформі 
        Rozetka маркетингових/спеціальних пропозицій(фінансових лімітів) для придбання товарів та/або послуг.
        Ми цінуємо ваше право на особисте життя та нерозголошення вашої персональної інформації. 
        Ця Угода користувача — правило, яким користуються всі співробітники нашого сервісу, 
        та регламентує збір і використання особистої інформації, яка може бути запитана/отримана при 
        відвідуванні Он-лайн платформи buyeranastasiia: при використанні сервісу, при замовленні, листуванні, 
        телефонній розмові, будь-якої іншої комунікації, при якій здійснюється обмін даними/інформацією. 
        Якщо у вас виникнуть питання або проблеми у зв’язку з конфіденційністю, надсилайте, 
        будь ласка, свої питання або зауваження на електронну адресу: anastasia.zagorodnyaya@gmail.com
    </p>
    <h2 className="font-bold text-xl">Яку інформацію ми збираємо</h2>
    <p>
        На Он-лайн платформі buyeranastasiia, в разі, коли ви робите замовлення, берете участь в акції, дослідженнях або іншим чином взаємодієте з нами, ми збираємо як особисту інформацію, так і загальні дані.
        Особиста інформація стосується окремого користувача та обробляється в порядку, межах, з метою, визначених в Положенні. Ми не вимагаємо реєстрації або надання такої інформації для перегляду нашої Он-лайн платформи та отримання доступу до його змісту.
        Для того щоб зробити замовлення товарів/послуг, брати участь у акціях, дослідженнях або іншим чином взаємодіяти з нами, ви повинні уважно ознайомитися з вашими правами та обов’язками щодо обробки персональних даних, які зазначені в ст. 8 Законі України «Про захист персональних даних» та Положенні, уважно ознайомитися з даною Угодою користувача та Положенням, а також висловити свою повну згоду з їх умовами.
        Якщо ви не погоджуєтеся з будь-якою з умов даної Угоди користувача та Положення про обробку і захист персональних даних, будь ласка, не надавайте особисту інформацію (персональні дані).
        Згоду на використання вашої особистої інформації ви можете відкликати в будь-який момент. Для цього достатньо надіслати повідомлення електронною поштою, з поміткою в темі листа «Персональні дані», за адресою: anastasia.zagorodnyaya@gmail.com
    </p>
    <h2 className="font-bold text-xl">Чому ми обробляємо персональні дані</h2>
    <p>
        Термін «персональні дані» використовується в значенні, визначеному в Законі України «Про захист персональних даних» та становить сукупність відомостей про користуваня, які визначаються в Положенні .
        Ми можемо обробляти ваші персональні дані для цілей та з метою, визначених в Положенні. При цьому одночасно можуть застосовуватися одна або кілька цілей.
        Ми діємо відповідно до цієї Угоди користувача, на підставі Положення про обробку і захист персональних даних та на підставі чинного законодавства України. Володільцем персональних даних є ФОП Загородня Анастасія Сергівна, що знаходиться за адресою : Київська обл. вулю Шалімова 69б. Ми маємо право зберігати Персональні дані стільки, скільки необхідно для реалізації мети, що зазначена у даній Угоді користувача та Положенні.
    </p>
    <h2 className="font-bold text-xl">Як збираємо інформацію</h2>
    <p>
        Мета, цілі обробки персональних даних, а також інші умови щодо обробки персональних даних визначаються в Положенні.
        Особиста інформація, як ми зазначили вище, надходить безпосередньо від вас, та з вашого відома. Так, коли ви реєструєтеся на Он-лайн платформі, ми отримуємо надану вами інформацію. Коли ви реєструєтеся в промо-акції, ми збираємо інформацію, необхідну для вашої участі, аби виконати наші зобов’язання перед вами. Коли ви здійснюєте замовлення товару, ми збираємо вказану вами інформацію, щоб мати змогу оформити замовлення та доставити його вам. Коли ви надсилаєте нам електронного листа, ми зберігаємо вказану вами адресу електронної пошти, щоб мати змогу відповісти, тощо.
        Також ми постійно збираємо загальну інформацію, коли ви заходите на нашу Он-лайн платформу. Процес збору таких даних відбувається з допомогою технологій cookies, як пояснюється нижче.
    </p>
    <h2 className="font-bold text-xl">Як видалити акаунт?</h2>
    <p>
        Увійдіть до особистого кабінету, ввівши логін і пароль.
        Виберіть розділ Особистий кабінет.
        Гортайте сторінку донизу.
        Виберіть Видалити акаунт назавжди.
        Натисніть Видалити мій акаунт.
        При видаленні акаунту, ми призупиняємо обробку ваших персональних даних, які обробляли на основі вашої згоди з умовами використання сайту.
        Cookies
    </p>
    <h2 className="font-bold text-xl">Cookies</h2>
    <p>
        Як і багато інших компаній, ми використовуємо технологію cookies на нашій Он-лайн платформі та поза її межами. 
        Cookies — це уривки інформації, які Он-лайн платформа передає на жорсткий диск споживача (Користувача) для зберігання інформації, 
        пов’язаної з Он-лайн платформою. Ця технологія розширює ваші можливості використання інтернету, 
        зберігаючи ваші пріоритети під час перегляду певного сайту. Технологія cookies не містить особистої 
        інформації і не може жодним чином налаштовувати вашу систему або зчитувати інформацію з вашого жорсткого диска.
        Під час перегляду нашої Он-лайн платформи ми можемо розмістити cookies на вашому комп’ютері. 
        Такі тимчасові cookies використовують для підрахунку кількості візитів на нашу Он-лайн платформу. 
        Вони видаляються, коли ви виходите з браузера. Постійні cookies можуть зберігатися на вашому комп’ютері вашим браузером. 
        Під час реєстрації цей тип cookies повідомляє: вперше ви до нас завітали чи заходили на нашу Он-лайн платформу раніше. 
        Cookie не містять Персональних даних і можуть бути заблоковані вами у будь-який момент. 
        Сookies не отримують особистої інформації про вас та не надають нам вашої контактної інформації, 
        а також не отримують жодної інформації з вашого комп’ютера. Ми використовуємо cookies для визначення 
        характеристик Он-лайн платформи та пропозицій, які вам найбільше подобаються з метою надання вам більше інформації, 
        в якій ви зацікавлені. Крім того, файли cookie використовуються, щоб зробити Он-лайн платформу Buyer Anastasiia безпечною, 
        захищеною і зручною. Файли cookie забезпечують підтримку функцій безпеки та їх запуск. 
        Файли cookie також дозволяють відстежувати порушення Угоди користувача відвідувачами або пристроями. 
        Файли cookie допомагають оцінити кількість і частоту запитів, а також виявляти і блокувати тих відвідувачів або пристрої, 
        які намагаються виконати пакетні завантаження інформації з Он-лайн платформи.
        Ярлик «help» на панелі більшості браузерів проінформує вас як заборонити браузеру приймати нові cookies, 
        як отримувати повідомлення від браузера, що ви отримали нові cookies, або як відключити cookies. 
        Пам’ятайте, що cookies дозволяють вам повною мірою користуватися всіма можливостями Он-лайн платформи Buyer Anastasiia, 
        і ми рекомендуємо вам залишати їх ввімкненими.
        Крім того, Он-лайн платформа Buyer Anastasiia може містити посилання на сайти, які не управляються ФОП Загородня Анастасія Сергіївна. УА». 
        Такі посилання наведені виключно для інформаційних цілей. При переході на за посиланнями на інші сайти дія цього 
        Положення та цієї Угоди користувача на такі сайти не поширюється.
        Технічне оснащення сторінок Он-лайн платформи Buyer Anastasiia може включати в себе модулі:
        Facebook, Twitter, Youtube (youtube.com), Google+ (plus.google.com), Telegram, Instagram, Viber.
        Ці модулі можуть бути кнопками синхронізації аккаунту на Он-лайн платформі Buyer Anastasiia, Like, ретвітнути або 
        відповідно «Мені подобається». Якщо відвідувач відкривав одну з веб-сторінок, оснащену таким плагіном, 
        його інтернет-браузер безпосередньо підключить його до серверів Facebook, Twitter, LinkedIn, Google+, Youtube Telegram, 
        Instagram, Viber. Плагін буде передавати на сервер дані про те, які саме веб-сторінки Он-лайн платформи 
        Rozetka відвідувач переглядав. При використанні будь-яких функцій плагіну, ця інформація також буде 
        синхронізована з обліковим записом відвідувача на Facebook, Twitter, Google+ , Youtube Telegram, Instagram, Viber. 
        Більш детальну інформацію про збір і використання даних мережами Facebook, Twitter, Google+,
         Youtube Telegram, Instagram, Viber, а також про права і можливості щодо захисту персональних даних в 
         даному контексті можна знайти в розділі про конфіденційність на сайтах Facebook, Twitter, LinkedIn, Google+, 
         Youtube, Telegram, Instagram, Viber.
    </p>
    <h2 className="font-bold text-xl">Конкурси та акції</h2>
    <p>
    Он-лайн платформа Buyer Anastasiia іноді розміщує повідомлення про промо-акції із можливістю зареєструватися онлайн. 
    У таких випадках ми використаємо надану Вами інформацію, щоб провести акцію (наприклад, повідомити Вас у разі виграшу). 
    Через певний час після закінчення промо-акції особисту інформацію ми видаляємо із нашої бази даних, 
    якщо Ви не надали згоди на її збереження та використання для отримання подальшої інформації від нас. 
    Беручи участь в акції ви надаєте однозначну згоду на безкоштовне використання вашого імені, прізвища, фотографії, 
    інтерв’ю або інших матеріалів про вас з рекламною метою, у тому числі право публікації вашого імені та фотографії
     у засобах масової інформації, будь-яких друкованих, аудіо- та відеоматеріалах, інтерв’ю зі ЗМІ. 
     Таке використання не компенсується (не оплачується).
    Умови щодо передачі персональних даних третім особам в таких випадках визначені в Положенні.
    </p>
    <h2 className="font-bold text-xl">Ціни та наявність товару</h2>
    <p>
        Опис товарів, що розміщений на Он-лайн платформі, в тому числі ціни позначені на Он-лайн платформі та 
        інформація щодо наявності товарів, може змінюватись. Сума замовлення може змінюватись в залежності від ціни, 
        кількості, номенклатури товару наявного у продавця на дату відвантаження. Остаточна вартість товару зазначається 
        в розрахункових та/або товаросупровідних документах, що надаються покупцеві (або його представнику) під час 
        отримання замовлення. У випадку відсутності товару продавець може в односторонньому порядку скасовувати замовлення.
    </p>
    <h2 className="font-bold text-xl">Треті сторони, що надають послуги</h2>
    <p>
        У процесі роботи ми звертаємося до інших компаній та осіб, які виконують багато функцій. 
        Наприклад, виконання та доставку замовлень, надання підтримки споживачів, замовляємо в 
        певних агенцій адміністрування промо-кампаній, аналіз даних. Ці агенції можуть мати доступ до особистої інформації, 
        якщо це необхідно для виконання їхніх функцій, однак їм заборонено використовувати особисту інформацію з іншою метою, 
        ніж та, яка зазначена в нашій Угоді користувача та в нашому Положенні про обробку і захист персональних даних, 
        і ми вимагаємо від них дотримання конфіденційності.
        Загальна інформація стосується таких аспектів, як кількість відвідувачів Он-лайн платформи, 
        на які сторінки вони заходять, яку інформацію завантажують, тип веб-браузера та операційна система, 
        яку вони використовують, назва провайдера інтернет-послуг, тощо. Коли Ви заходите на нашу Он-лайн платформу, 
        ми автоматично отримуємо цю інформацію та узагальнюємо з подібними даними про інших відвідувачів. 
        Збираючи таку інформацію, ми аналізуємо, як краще пристосувати нашу Он-лайн платформу до потреб відвідувачів.
    </p>
    <h2 className="font-bold text-xl">Розголошення та передача даних</h2>
    <p>Інформація про умови розкриття інформації про персональні дані третім особам міститься в Положенні.</p>
    <h2 className="font-bold text-xl">Оновлення цієї Угоди</h2>
    <p>
    Коли ви робите замовлення, берете участь в акції, дослідженнях або іншим чином взаємодієте з нами, 
    ви погоджуєтесь з умовами Угоди користувача та Положення.
    Ми можемо в односторонньому порядку змінювати або оновлювати частини цієї Угоди в будь-який час, 
    без попереднього повідомлення. Будь-ласка, час від часу переглядайте Угоду користувача, 
    щоб знати про її зміни та оновлення. Усі зміни до цієї Угоди користувача набувають чинності з моменту їх публікації. 
    У випадку визнання недійсною або нездійсненною будь-якої частини даної Угоди користувача, 
    інші її частини будуть залишатися чинними.
    </p>
    
</div>
  )
}

export default LegalTermsPage