import React from 'react';

const PrivacyPage = () => {
  return (
    <div className="text-gray-800 my-12 mx-12 flex flex-col gap-4 text-sm font-normal">
            <h1 className="font-bold text-2xl">Загальні положення</h1>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    1.1. Справжня оферта є офіційною пропозицією «natural.com.ua», далі за текстом – «Продавець», 
                    укласти Договір купівлі-продажу товарів дистанційним способом, тобто через Інтернет – магазин, 
                    далі по тексту «Договір», і розміщує публічну оферту(пропозиція) на офіційному Інтернет – сайті 
                    Продавця «https://buyeranastasiia.com.ua» (далі – «Інтернет – сайт»).
                </li>
                <li>
                    1.2.Моментом повного і безумовного прийняття Покупцем пропозиції Продавця (акцептом) укласти електронний 
                    договір купівлі-продажу товарів, вважається факт оплати Покупцем замовлення на умовах цього Договору, 
                    у терміни та за цінами, вказаними на Інтернет – сайті Продавця.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">Поняття та визначення</h2>
            <p>
                2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають таке значення:
                *«Товар» – моделі, аксесуари, комплектуючі та супровідні предмети;
                *«Інтернет – магазин» – відповідно до Закону України «Про електронну комерцію», засіб для подання або реалізації товару, роботи або послуги шляхом здійснення електронної угоди.
                *«Продавець» – компанія, яка реалізовує товари, представлені на Інтернет – сайті.
                *«Покупець» – фізична особа, що уклала з продавцем договір на умовах, викладених нижче.
                *«Замовлення» – вибір окремих позицій з переліку товарів, зазначених Покупцем при розміщенні замовлення і проведенні оплати.
            </p>
        <h2 className="font-bold text-xl">Предмет договору</h2>
        <ul>
            <li>
                3.1. Продавець зобов’язується передати у власність Покупця Товар, а Покупець зобов’язується 
                оплатити і прийняти Товар на умовах даного Договору.
                Цей договір регулює купівлю – продаж товарів в Інтернет – магазині, в тому числі:
                -Добровільний вибір Покупцем товарів в Інтернет – магазині;
                -Самостійне оформлення Покупцем товарів в Інтернет – магазині;
                -Оплата Покупцем замовлення, оформленого в Інтернет – магазині;
                -Обробка і доставка замовлення Покупцеві у власність на умовах цього Договору.
            </li>
        </ul>
        <h2 className="font-bold text-xl">ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    4.1. Покупець має право оформити замовлення на будь – який товар, представлений на Сайті Інтернет – магазину і який наявний.
                </li>
                <li>
                    4.2. Кожна позиція може бути представлена в замовленні в будь – якій кількості.
                </li>
                <li>
                    4.3. При відсутності товару на складі , Менеджер компанії зобов’язаний поставити покупця до відома (по телефону, через мессенджер або через електронну пошту).
                </li>
                <li>
                4.4. При відсутності товару Покупець має право замінити його товаром аналогічної моделі, відмовитися від даного товару, анулювати замовлення.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ПОРЯДОК ОПЛАТИ ЗАМОВЛЕННЯ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>5.1 Оплата може будти здійснена при використанні платіжної системи</li>
                <li>5.2 Опдата може бути здійснена частинами через банк в момент оформлення замовлення</li>
                <li>5.4. При не надходженні грошових коштів Інтернет – магазин залишає за собою право анулювати замовлення.</li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">УМОВИ ДОСТАВКИ ЗАМОВЛЕННЯ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    6.1. Доставка товарів, придбаних в Інтернет – магазині, здійснюється до складів транспортних компаній, де й здійснюється видача замовлень.
                </li>
                <li>
                    6.2. Разом із замовленням Покупцеві надаються документи згідно законодавства України.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН:</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    7.1. Продавець має право:
                    – в односторонньому порядку припинити надання послуг за цим договором у разі порушення Покупцем умов цього договору.
                </li>
                <li>
                    7.2. Покупець зобов’язаний:
                    – своєчасно оплатити та отримати замовлення на умовах цього договору
                </li>
                <li>
                    7.3. Покупець має право:
                    – оформити замовлення в Інтернет – магазині;
                    – оформити електронний договір;
                    – вимагати від Продавця виконання умов цього Договору.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    8.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цього договору в порядку, передбаченому цим договором та чинним законодавством України.
                </li>
                <li>
                    8.2. Продавець не несе відповідальності за:
                    – змінений виробником зовнішній вигляд Товару;
                    – за незначну невідповідність колірної гами товару, що може відрізнятися від оригіналу товару виключно через різну колірну передачу моніторів персональних комп’ютерів окремих моделей;
                    – за зміст і правдивість інформації, наданої Покупцем при оформленні замовлення;
                    – за затримку і перебої в наданні Послуг ( обробки замовлень та доставки товару), які відбуваються з причин, що знаходяться поза сферою його контролю;
                    – за протиправні незаконні дії, здійснені Покупцем за допомогою даного доступу до мережі Інтернет;
                    – за передачу Покупцем своїх мережевих ідентифікаторів –   ІР, МАС- адреси, логіна і пароля третім особам;
                </li>
                <li>
                    8.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно несе відповідальність за шкоду, 
                    заподіяну його діями (особисто, навіть якщо під його логіном знаходилась інша особа) особам або їх майну, 
                    юридичним особам, державі чи моральним принципам моральності.
                </li>
                <li>
                    8.4. У разі настання обставин непереборної сили, сторони звільняються від виконання умов цього договору. 
                    Під обставинами непереборної сили для цілей цього договору розуміються події, що мають надзвичайний, 
                    непередбачений характер, які виключають або об’єктивно заважають виконанню цього договору, 
                    настання яких Сторони не могли передбачити і запобігти розумними способами.
                </li>
                <li>
                    8.5. Сторони прикладають максимум зусиль для вирішення будь – яких розбіжностей виключно шляхом переговорів.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ІНШІ УМОВИ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    9.1. Інтернет – магазин залишає за собою право в односторонньому порядку вносити зміни до цього договору за умови попередньої публікації його на сайті https://buyeranastasiia.com.ua
                </li>
                <li>
                    9.2. Інтернет – магазин створений для організації дистанційного способу продажу товарів через Інтернет.
                </li>
                <li>
                    9.3. Покупець несе відповідальність за достовірність інформації, зазначеної при оформленні замовлення. При цьому, при здійсненні акцепту (оформленні замовлення і подальшої оплати товару) Покупець надає Продавцю свою беззастережну згоду на збір, обробку, зберігання, використання своїх персональних даних, в розумінні ЗУ «Про захист персональних даних».
                </li>
                <li>
                    9.4. Оплата Покупцем оформленого в Інтернет – магазині замовлення означає повну згоду Покупця з умовами договору купівлі – продажу (публічної оферти).
                </li>
                <li>
                    9.5. Фактичною датою електронної угоди між сторонами є дата прийняття умов, відповідно до ст.11 Закону України «Про електронну комерцію»
                </li>
                <li>
                    9.6. Використання ресурсу Інтернет – магазину для попереднього перегляду товару, а також для оформлення замовлення для Покупця є безкоштовним.
                </li>
                <li>
                    9.7. Інформація, яка надається Покупцем є конфіденційною. Інтернет – магазин використовує інформацію про Покупця виключно в цілях обробки замовлення, відправлення повідомлень Покупцеві, доставки товару, здійснення взаєморозрахунків і ін.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ПОРЯДОК ПОВЕРНЕННЯ ТОВАРУ НАЛЕЖНОЇ ЯКОСТІ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    10.1. Повернення товару в Інтернет – магазин проводиться згідно чинного законодавства України.
                </li>
                <li>
                    10.2. Повернення товару в Інтернет – магазин проводиться за рахунок Покупця.
                </li>
                <li>
                    10.3. При поверненні Покупцем товару належної якості, Інтернет – магазин повертає йому сплачену за товар грошову суму за фактом повернення товару за вирахуванням компенсації витрат Інтернет – магазину пов’язаних з доставкою товару Покупцеві.
                </li>
            </ul>
        </p>
        <h2 className="font-bold text-xl">ТЕРМІН ДІЇ ДОГОВОРУ</h2>
        <p>
            <ul className='flex flex-col gap-1'>
                <li>
                    11.1. Електронний договір вважається укладеним з моменту одержання особою яка направила пропозицію укласти такий договір, відповіді про прийняття цієї пропозиції в порядку, визначеному частиною шостою статті 11 Закону країни «Про електронну комерцію».
                </li>
                <li>
                    11.2. До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою сторін до моменту фактичної доставки товару, шляхом повернення грошових коштів.
                </li>
                <li>
                    11.3. Сторони мають право розірвати цей договір в односторонньому порядку,в разі невиконання однією із сторін умов цього Договору та у випадках передбачених чинним законодавством України.
                </li>
            </ul>
        </p>
    </div>
  )
}

export default PrivacyPage